//---------------------------------------------------------
// 
//	iruna_line.h
//	当たり判定用線
//	作成日 11月13日
//	製作者 立川 翔野
// 
//---------------------------------------------------------
/*----多重インクルード防止-------------------------------------------------*/
#ifndef IRUNA_LINE_H
#define IRUNA_LINE_H


/*----インクルード-------------------------------------------------*/
#include "../Include/iruna_utility.h"
#include "../Include/iruna_vector3.h"

/*----データ型 宣言------------------------------------------------*/
namespace iruna
{
namespace geometry
{

//=====================================================================
//
//	クラス名	:	Line
//	処理		:	当たり判定用線構造体
//
//=====================================================================
struct Line
{
//	パブリックメンバ変数
public:
	math::Vector3	origin;		// ラインの始点
	math::Vector3	normal;		// ラインの向き(正規化されたベクトル)

//	パブリックメンバ関数
public:

	
	//--------------------------------------------------------------------
	// 
	//	処理		:	コンストラクタ
	// 
	//--------------------------------------------------------------------
	Line();

	
	//--------------------------------------------------------------------
	// 
	//	処理		:	コンストラクタ
	//	第1引数		:	[in] setOrigin		- 線の始点
	//	第2引数		:	[in] setNormal		- 線の向き
	// 
	//--------------------------------------------------------------------
	Line( math::Vector3 setOrigin, math::Vector3 setNormal );

	
	//--------------------------------------------------------------------
	// 
	//	処理		:	デストラクタ
	// 
	//--------------------------------------------------------------------
	~Line();
};

}	//	geometry	end
}	//	iruna		end

#endif	//	IRUNA_LINE_H	end