//---------------------------------------------------------
// 
//	iruna_aabb.h
//	当たり判定用軸並行境界ボックス( Axis-Aligned Bounding Box )
//	作成日 11月13日
//	製作者 立川 翔野
// 
//---------------------------------------------------------
/*----多重インクルード防止-------------------------------------------------*/
#ifndef IRUAN_AABB_H
#define IRUAN_AABB_H

/*----インクルード-------------------------------------------------*/
#include "../Include/iruna_utility.h"
#include "../Include/iruna_vector3.h"

/*----データ型 宣言------------------------------------------------*/
namespace iruna
{
namespace geometry
{

//=====================================================================
//
//	クラス名	:	Aabb
//	処理		:	軸並行境界ボックス構造体
//
//=====================================================================
struct Aabb
{
//	プライベート　メンバ変数
public:

	math::Vector3	min;	// 最小値の座標
	math::Vector3	max;	// 最大値の座標

//	プライベート	メンバ関数
public:

	//--------------------------------------------------------------------
	// 
	//	処理		:	コンストラクタ
	// 
	//--------------------------------------------------------------------
	Aabb();

	//--------------------------------------------------------------------
	// 
	//	処理		:	コンストラクタ
	//	第1引数		:	[in] setOrigin		- 中心点
	//	第2引数		:	[in] setHalfWidths	- ボックスの半径
	// 
	//--------------------------------------------------------------------
	Aabb( math::Vector3 setOrigin, math::Vector3 setHalfWidths );

	//--------------------------------------------------------------------
	// 
	//	処理		:	デストラクタ
	// 
	//--------------------------------------------------------------------
	~Aabb();

	//--------------------------------------------------------------------
	// 
	//	処理		:	指定した中心点に作成する
	//	第1引数		:	[in] setOrigin	- 指定する中心点
	// 
	//--------------------------------------------------------------------
	void	SetOrigin( math::Vector3 setOrigin );


	//--------------------------------------------------------------------
	// 
	//	処理		:	中心点を取得する
	// 
	//--------------------------------------------------------------------
	math::Vector3	GetOrigin() const;


	//--------------------------------------------------------------------
	// 
	//	処理		:	指定した半径で作成する
	//	第1引数		:	[in] setHalfWidths	- 指定する中心点
	// 
	//--------------------------------------------------------------------
	void	SetHalfWidths( math::Vector3 setHalfWidths );


	math::Vector3	GetHalfWidths() const;


};

}	//	geometry	end
}	//	iruna		end


#endif	//	IRUAN_AABB_H	end