//--------------------------------------------------------------------------------------
// グローバル変数定義
//--------------------------------------------------------------------------------------
float4x4 	g_vlp;

//--------------------------------------------------------------------------------------
// バーテクスシェーダー
//--------------------------------------------------------------------------------------
void BasicShadowBufVS( 	float4 in_pos : POSITION,
						out float4 out_pos : POSITION,
						out float4 out_depth : TEXCOORD0)
{	
	// 座標変換
	out_pos = mul(in_pos, g_vlp);

	// 位置情報の出力
	out_depth  = out_pos;
}


//--------------------------------------------------------------------------------------
// ピクセルシェーダー
//--------------------------------------------------------------------------------------
void BasicShadowBufPS(	float4 in_depth : TEXCOORD0,
						out float4 color : COLOR)
{
	// ピクセルの深度情報を計算して出力
	color  = in_depth.z / in_depth.w;
}

//--------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------
technique BasicTech
{
    pass P0
    {
        VertexShader = compile vs_3_0 BasicShadowBufVS();
        PixelShader  = compile ps_3_0 BasicShadowBufPS();
	}
}
