//---------------------------------------------------------
// 
//	iruna_sphere.h
//	当たり判定用球
//	作成日 11月13日
//	製作者 立川 翔野
// 
//---------------------------------------------------------
/*----多重インクルード防止-------------------------------------------------*/
#ifndef IRUNA_SPHERE_H
#define IRUNA_SPHERE_H

/*----インクルード-------------------------------------------------*/
#include "../Include/iruna_utility.h"
#include "../Include/iruna_vector3.h"

/*----データ型 宣言------------------------------------------------*/
namespace iruna
{
namespace geometry
{

//=====================================================================
//
//	クラス名	:	Sphere
//	処理		:	当たり判定用球構造体
//
//=====================================================================
struct Sphere
{
//	パブリックメンバ変数
public:

	math::Vector3	origin;		// 球の中心
	float			radius;		// 球の半径

//	パブリックメンバ関数
public:
	//--------------------------------------------------------------------
	// 
	//	処理		:	コンストラクタ
	// 
	//--------------------------------------------------------------------
	Sphere();

	//--------------------------------------------------------------------
	// 
	//	処理		:	コンストラクタ
	//	第1引数		:	[in] setOrigin		- 中心点
	//	第2引数		:	[in] setRadius		- 球の半径
	// 
	//--------------------------------------------------------------------
	Sphere(  math::Vector3 setOrigin, float setRadius );

	
	//--------------------------------------------------------------------
	// 
	//	処理		:	デストラクタ
	// 
	//--------------------------------------------------------------------
	~Sphere();

};

}	//	geometry	end
}	//	iruna		end

#endif	//	IRUNA_SPHERE_H	end